W4/W4D2/Contacts/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "email", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 03 May 2014 20:41:40 UTC +00:00], ["email", "estefany@gmail.com"], ["name", "Estefany Zendejas"], ["updated_at", Sat, 03 May 2014 20:41:40 UTC +00:00], ["user_id", 1]]
---
  def create
    contact = Contact.new(contact_params)
    if contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "contacts" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "contacts"."id" = 5  [["name", "Stella"], ["email", "stella2@gmail.com"], ["updated_at", Sat, 03 May 2014 21:42:20 UTC +00:00]]
---
  def update
    @contact = Contact.find(params[:id])

    if @contact.update_attributes(contact_params)