W4/W4D2/Contacts/app/controllers/contact_shares_controller.rb

INSERT INTO "contact_shares" ("contact_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["contact_id", 2], ["user_id", 3]]
---
	def create
		@contact_share = ContactShare.new(contact_share_params)

		if @contact_share.save!

SELECT "contact_shares".* FROM "contact_shares" WHERE "contact_shares"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "contact_shares" WHERE "contact_shares"."id" = $1  [["id", 3]]
---
	def destroy
		@contact_share = ContactShare.find(params[:id])
		@contact_share.destroy