W4/W4D2/Contacts/app/controllers/users_controller.rb

  def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 03 May 2014 20:38:34 UTC +00:00], ["updated_at", Sat, 03 May 2014 20:38:34 UTC +00:00], ["username", "\"Patty\""]]

  def update
		@user = User.find(params[:id])

		if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["username", "Patty"], ["updated_at", Sat, 03 May 2014 20:38:59 UTC +00:00]]