W4/W4D3/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save!
---
INSERT INTO "cats" ("age", "color", "created_at", "name", "sex", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["age", 87], ["color", "blue"], ["created_at", Wed, 23 Apr 2014 21:46:37 UTC +00:00], ["name", "Ginger"], ["sex", "f"], ["updated_at", Wed, 23 Apr 2014 21:46:37 UTC +00:00]]

  def update
    @cat = Cat.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "cats" SET "name" = ?, "updated_at" = ? WHERE "cats"."id" = 5  [["name", "apple"], ["updated_at", Wed, 23 Apr 2014 23:20:01 UTC +00:00]]