W4/W4D5/app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at") VALUES (?, ?, ?, ?, ?)